Revit 2024 API
TableCellCombinedParameterData.CategoryId Property
 Category id for this parameter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId CategoryId { get; set; }
Visual Basic
Public Property CategoryId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ CategoryId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
TableCellCombinedParameterData Class
Autodesk.Revit.DB Namespace